---
kind: method
id: M:Autodesk.Revit.DB.Structure.AnalyticalElement.IsValidAnalyzeAs(Autodesk.Revit.DB.Structure.AnalyzeAs)
source: html/98f5eb53-b973-3cdc-ebce-7f0ee16d1378.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalElement.IsValidAnalyzeAs Method

Checks whether the value set for Analyze As is valid for an Analytical Element.

## Syntax (C#)
```csharp
public bool IsValidAnalyzeAs(
	AnalyzeAs analyzeAs
)
```

## Parameters
- **analyzeAs** (`Autodesk.Revit.DB.Structure.AnalyzeAs`) - The value set to be verified.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration